artillery/deriva-load-test.yml
config:
  target: "https://staging.atlas-d2k.org"
  phases:
    - duration: 60
      arrivalRate: 5
      maxVusers: 10
  engines:
    playwright: { aggregateByName: true}
  processor: ./../playwright/src/utils/test-page-load.js
scenarios:
  - name: "test_recordset_page_load"
    engine: playwright
    flowFunction: "testChaisePageLoad"