artillery/deriva-load-test.yml
config:
  target: "https://staging.atlas-d2k.org"
  phases:
    - duration: 60
      arrivalRate: 5
      maxVusers: 25
  engines:
    playwright: { aggregateByName: true}
  processor: ./scripts.js
scenarios:
  - name: "check_deriva_page_load"
    engine: playwright
    flowFunction: "checkDerivaPageLoad"